{"status":"ok","totalResults":11743,"articles":[{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Jake Bright","title":"Talking to Zero Motorcycles’ CEO and taking home the 2020 SR/F","description":"The motorcycle industry is shifting to electric. Harley Davidson signaled the trend this year, becoming the first big gas manufacturer to release a street-legal e-motorcycle in the US, the LiveWire. But before Harley’s EV pivot, California based startup Zero …","url":"http://techcrunch.com/2019/11/05/talking-to-zero-motorcycles-ceo-and-taking-home-the-2020-sr-f/","urlToImage":"https://techcrunch.com/wp-content/uploads/2019/09/ZERO-LEAD-REVISE-IV.jpg?w=600","publishedAt":"2019-11-05T20:24:47Z","content":"The motorcycle industry is shifting to electric. Harley-Davidson signaled the trend this year, becoming the first big gas manufacturer to release a street-legal e-motorcycle in the U.S., the LiveWire.\r\nBut before Harleys EV pivot, California-based startup Zer… [+5465 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"Michael Cooper","title":"She’s Putting Her Mark on the Kennedy Center","description":"Deborah F. Rutter built a major expansion at Washington’s venerable arts complex. Now she wants more people to come.","url":"https://www.nytimes.com/2019/11/01/arts/music/deborah-rutter-kennedy-center.html","urlToImage":"https://static01.nyt.com/images/2019/11/01/us/01rutter1/merlin_161357628_943220aa-f762-461d-bf7d-b0591b8cbf5e-facebookJumbo.jpg","publishedAt":"2019-11-03T15:16:47Z","content":"It was David M. Rubenstein, the chairman of the Kennedy Centers board, who pushed to update the center. He was inspired by the renovation of Lincoln Center, where he was a major donor, which was completed in 2012. He decided not to go to Congress for money; m… [+1467 chars]"},{"source":{"id":"mashable","name":"Mashable"},"author":"Siobhan Neela-Stock","title":"McDonald's and Taco Bell get graded on their beef. Which one got an F?","description":"The overuse of antibiotics is probably far from your mind when you order a beef burger from a fast food chain. But it shouldn't be. A new report out Thursday rates top U.S. restaurant chains like McDonald's, Starbucks, and Chipotle on their commitments to red…","url":"https://mashable.com/article/mcdonalds-taco-bell-chipotle-antibiotics-in-beef/","urlToImage":"https://mondrian.mashable.com/2019%252F10%252F31%252F19%252F5155d667d5834f16bb5af4f04aa77cca.6d6b0.jpg%252F1200x630.jpg?signature=M3ylKkHax6HZDXuu9EbRXHt0jA0=","publishedAt":"2019-10-31T09:00:00Z","content":"The overuse of antibiotics is probably far from your mind when you order a beef burger from a fast food chain. But it shouldn't be.\r\nA new report out Thursday rates top U.S. restaurant chains like McDonald's, Starbucks, and Chipotle on their commitments to re… [+8348 chars]"},{"source":{"id":null,"name":"Lifehacker.com"},"author":"Joel Kahn","title":"How to Stop Caring About Stuff That Doesn't Matter","description":"Many people would say their biggest weakness is that they care too much. Read more...","url":"https://lifehacker.com/how-to-stop-caring-about-stuff-that-doesnt-matter-1839508201","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/v4omzkn3wlgejd4ch8mi.jpg","publishedAt":"2019-11-01T15:30:00Z","content":"Many people would say their biggest weakness is that they care too much.\r\nIf thats the case for you, Mark Manson, author of The Subtle Art of Not Giving a F*ck has some advice for you.\r\nYou should give a fuck, Manson explains, Its just that you should only gi… [+214 chars]"},{"source":{"id":null,"name":"Cnet.com"},"author":"Sean Szymkowski","title":"Shelby Super Snake Sport F-150 shows its fangs - Roadshow","description":"Shelby American has one badass truck ready for the 2019 SEMA show.","url":"https://www.cnet.com/roadshow/pictures/shelby-ford-f150-gt500-sema/","urlToImage":"https://cnet1.cbsistatic.com/img/lF38uEmYIV3EgSz22nT4VgW-bXo=/2019/11/04/088c7739-cc7e-46d0-b11d-d80657bdcabc/ogi-f150.jpg","publishedAt":"2019-11-05T22:53:23Z","content":"It's a two-door version of the Super Snake Shelby builds, but this is like the F-150 Lighting we never received."},{"source":{"id":null,"name":"Kotaku.com"},"author":"Cecilia D'Anastasio","title":"Five Years Of 'F' To Pay Respects","description":"“F” in a moment of internet tragedy, when a YouTuber confesses they were mercilessly dumped. In a flash of live, online embarrassment, when an Overwatch player misclicks on ult, “F.” The internet is a graveyard of “FFFFFFFF,” with some uncountable number toss…","url":"https://kotaku.com/five-years-of-f-to-pay-respects-1839604767","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/o2ofv79fez0twpelom0v.png","publishedAt":"2019-11-04T14:15:00Z","content":"F in a moment of internet tragedy, when a YouTuber confesses they were mercilessly dumped. In a flash of live, online embarrassment, when an Overwatch player misclicks their ult, F. The internet is a graveyard of FFFFFFFF, with some uncountable number tossed … [+2551 chars]"},{"source":{"id":null,"name":"Theplayerstribune.com"},"author":null,"title":"Brother, I Have Some Stories to Tell | Marcelo - The Players' Tribune","description":"\"'If I have to die out here tonight,' I thought, 'F*** it. I’ll die.'\"\n\nMarcelo opens up like never before.","url":"https://www.theplayerstribune.com/en-us/articles/marcelo-real-madrid-brother-i-have-some-stories-to-tell","urlToImage":"https://storage.googleapis.com/www-theplayerstribune-com/uploads/89cdb0e8-marcelo-social-card.jpg","publishedAt":"2019-10-31T11:06:34Z","content":"PARA LER EM PORTUGUÊS, CLIQUE AQUI\r\nI couldnt breathe. I was trying not to panic. This was in the dressing room right before the Champions League final against Liverpool in 2018. \r\nIt felt like I had something stuck in my chest. This huge pressure. Do you kno… [+15857 chars]"},{"source":{"id":null,"name":"Yahoo.com"},"author":null,"title":"Could China's J-20 Stealth Jet Be The Dog Fighter To Unseat The F-22?","description":"How does the F-35 stack up?","url":"https://news.yahoo.com/could-chinas-j-20-stealth-053500995.html","urlToImage":null,"publishedAt":"2019-11-05T05:35:00Z","content":null},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Alan Dawson","title":"Jorge Masvidal drank liquor, ate pizza, and called Conor McGregor 'a f------ midget' in his post-fight press conference after dominating Nate Diaz","description":"Jorge Masvidal celebrated becoming the \"baddest mother f-----\" in the game by drinking mezcal and eating pizza at a post-event press conference. Masvidal won the \"BMF\" belt by dominating Nate Diaz at the UFC 244 event at Madison Square Garden in New York on S…","url":"https://www.businessinsider.com/jorge-masvidal-ate-pizza-and-called-conor-mcgregor-a-midget-2019-11","urlToImage":"https://image.businessinsider.com/5dbedfd12f364a59b167ae23?width=1200&format=jpeg","publishedAt":"2019-11-03T14:37:00Z","content":"Jorge Masvidal ate pizza, drank liquor, and called Conor McGregor \"a f------ midget\" at the post-fight press conference after he dominated Nate Diaz at UFC 244.\r\nMasvidal won every round in the main event at Madison Square Garden, New York on Saturday, poppin… [+2416 chars]"},{"source":{"id":"time","name":"Time"},"author":"Associated Press","title":"Toxicology Report: Robert F. Kennedy’s Granddaughter Died of Drug Overdose","description":"Authorities have determined that Saoirse Kennedy Hill, the 22-year-old granddaughter of late Robert F. Kennedy, died of a drug overdose.","url":"https://time.com/5716508/saoirse-kennedy-cause-death-drug-overdose/","urlToImage":"https://timedotcom.files.wordpress.com/2019/11/saoirse-kennedy-hill-death-overdose.jpg?quality=85&w=1200&h=628&crop=1","publishedAt":"2019-11-01T18:33:45Z","content":"(BARNSTABLE, Mass.) — Authorities have determined that Saoirse Kennedy Hill, the 22-year-old granddaughter of assassinated presidential candidate Robert F. Kennedy, died of a drug overdose.\r\nWCVB-TV reported on Friday that a toxicology test found methadone, f… [+634 chars]"},{"source":{"id":null,"name":"Digital-photography-school.com"},"author":"Jaymes Dempsey","title":"Canon Reveals the RF 70-200mm f/2.8L and the RF 85mm f/1.2L DS Lenses","description":"The post Canon Reveals the RF 70-200mm f/2.8L and the RF 85mm f/1.2L DS Lenses appeared first on Digital Photography School. It was authored by Jaymes Dempsey. Canon has announced two new lenses for its mirrorless lineup: The RF 70-200mm f/2.8L IS USM and the…","url":"https://digital-photography-school.com/new-canon-lenses-announced/","urlToImage":"https://i2.wp.com/digital-photography-school.com/wp-content/uploads/2019/10/dps-canon-reveals-new-lenses-feature.jpg?fit=1500%2C837&ssl=1","publishedAt":"2019-10-30T11:30:22Z","content":"By: Jaymes Dempsey on October 30, 2019\r\nCanon has announced two new lenses for its mirrorless lineup:The RF 70-200mm f/2.8L IS USM and the RF 85mm f/1.2L USM DS.\r\nLet’s take a closer look:\r\nThe Canon RF 70-200mm f/2.8L Lens\r\nThe Canon RF 70-200mm f/2.8L offer… [+2082 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Andrew Meola","title":"These are the 5 leaders in the self-driving-car race (GOOG, GOOGL, GM, F)","description":"Tech companies and auto companies are all racing to be the first to roll out self-driving cars onto the road. The stakes are high for everyone involved. The self-driving revolution and the prevalence of ride-hailing services such as Uber and Lyft threatens to…","url":"https://www.businessinsider.com/intelligence/the-self-driving-car-race","urlToImage":"https://static.businessinsider.com/image/5a5f9a50f421496e0f8b5415-720","publishedAt":"2019-11-01T01:02:00Z","content":"Tech companies and auto companies are all racing to be the first to roll out self-driving cars onto the road.\r\nThe stakes are high for everyone involved. The self-driving revolution and the prevalence of ride-hailing services such as Uber and Lyft threatens t… [+664 chars]"},{"source":{"id":null,"name":"Insider.com"},"author":"Kat Tenbarge","title":"The secret sauce to YouTube's viral food personalities — 'they f--- up constantly'","description":"Food videos are booming on YouTube — from mukbangs to challenge videos to recipes – and with media giants like BuzzFeed and Condé Nast pumping out mouthwatering content, the genre has become a staple of the average YouTube user's experience on the platform. U…","url":"https://www.insider.com/4-levels-epicurious-emily-lorenzo-food-videos-youtube-future-2019-10","urlToImage":"https://image.businessinsider.com/5dbd9083e94e860f636df43f?width=1200&format=jpeg","publishedAt":"2019-11-02T14:18:47Z","content":"If you watch and rewatch videos of people making and eating food on YouTube for hours on end, you're not alone. Food videos have been a popular aspect of media since Julia Child's debut in 1963. But what grew into a highly produced and profitable industry on … [+6751 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"Ed Shanahan","title":"Dermot Shea: What We Know About the N.Y.P.D.’s Next Commissioner","description":"The new leader of America’s largest police force is a 28-year department veteran who started as a beat officer in the Bronx.","url":"https://www.nytimes.com/2019/11/04/nyregion/dermot-shea-nypd-police-commissioner.html","urlToImage":"https://static01.nyt.com/images/2019/11/04/nyregion/04shea1/04shea1-facebookJumbo.jpg","publishedAt":"2019-11-04T21:33:35Z","content":"Dermot F. Shea, the Police Departments chief of detectives, was named New Yorks next commissioner on Monday, succeeding James P. ONeill as the leader of the largest police force in the United States. \r\nIn announcing the change, Mayor Bill de Blasio hailed Chi… [+553 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Alan Dawson","title":"Jorge Masvidal called Donald Trump a 'bad mother f-----' and the president responded by saying: 'Great fight, champ!'","description":"Jorge Masvidal called Donald Trump a \"bad mother f-----\" before his UFC 244 victory over Nate Diaz. Trump was in the crowd for the event at Madison Square Garden in New York City, and later congratulated Masvidal for the victory on Twitter. \"Great fight, cham…","url":"https://www.businessinsider.com/jorge-masvidal-donald-trump-is-a-bad-mother-2019-11","urlToImage":"https://image.businessinsider.com/5dbff84c2f364a197e2d5a42?width=1200&format=jpeg","publishedAt":"2019-11-04T11:32:36Z","content":"Jorge Masvidal dominated Nate Diaz in front of US President Donald Trump, who was in the crowd for the UFC 244 event at Madison Square Garden in New York City on Saturday.\r\nBut before Masvidal won the inaugural \"baddest mother f-----\" in the game belt, he app… [+2010 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Alan Dawson","title":"After dominating Nate Diaz, Jorge Masvidal has Canelo Alvarez in his crosshairs: 'If Canelo wants his ass kicked, that's a fight I'll take'","description":"Jorge Masvidal is already the \"baddest mother f-----\" in MMA and now wants to cross over and beat the best-known boxer on the planet. Saul 'Canelo' Alvarez won a world title in a fourth weight class after he knocked out the former WBO light heavyweight champi…","url":"https://www.businessinsider.com/jorge-masvidal-challenges-canelo-alvarez-to-a-fight-2019-11","urlToImage":"https://image.businessinsider.com/5dc188063afd3717a932b593?width=1200&format=jpeg","publishedAt":"2019-11-05T15:54:50Z","content":"Jorge Masvidal is already plotting his next move in combat sports and is desperate for a crossover bout against boxing's box office attraction Saul 'Canelo' Alvarez.\r\nMasvidal dominated his UFC 244 opponent Nate Diaz at Madison Square Garden in New York City … [+3274 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Matt Simon","title":"Wildfire Chasers Are the New Tornado Chasers","description":"A strike team of specially trained researchers drive a highly sophisticated truck into the literal line of fire. Their mission: unravel the extreme complexities of wildfire.","url":"https://www.wired.com/story/wildfire-chasers/","urlToImage":"https://media.wired.com/photos/5dbb6b3a5b8c9000084c7c82/191:100/w_1280,c_limit/Science_Firechaser_gX1BOr6FRciYNmBwqpVzOA-(1).jpg","publishedAt":"2019-11-01T11:00:00Z","content":"In the late hours of October 23, Craig Clements was grading papers when a colleague in Oakland texted him about a rapidly growing wildfire just north of San Francisco. He texted a few of his students, who jumped out of bed and rushed his way. Together they lo… [+2345 chars]"},{"source":{"id":null,"name":"Thevanguard.ca"},"author":"Elizabeth Patterson","title":"Time to get your annual flu vaccination - The Vanguard","description":"It didn’t hurt at all.\r\n\r\nWhen Tanya Howley, pharmacist/associate owner of Shoppers Drug Mart North Sydney, gave me my annual flu shot this past Monday, I hardly felt a pinch. But then, after giving thousands of f shots over the past few years,","url":"https://www.thevanguard.ca/news/provincial/time-to-get-your-annual-flu-vaccination-370288/","urlToImage":"https://www.thevanguard.ca/media/photologue/photos/cache/CB-29102019-flu_shot1_medium.jpg","publishedAt":"2019-10-31T10:44:09Z","content":"NORTH SYDNEY, N.S. — It didn’t hurt at all.\r\nWhen Tanya Howley, pharmacist/associate owner of Shoppers Drug Mart North Sydney, gave me my annual flu shot this past Monday, I hardly felt a pinch. But then, after giving thousands of f shots over the past few ye… [+2922 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Alan Dawson","title":"Jorge Masvidal opens Nate Diaz up with bloody cuts, wins 'baddest mother f-----' title, then celebrates with The Rock","description":"Jorge Masvidal easily beat Nate Diaz to be crowned the \"baddest mother f-----\" in the game. Masvidal out-struck Diaz, opened up cuts, and forced a doctor's stoppage at the end of the third round. He was awarded with the $50,000 \"BMF\" title, which was presente…","url":"https://www.businessinsider.com/jorge-masvidal-beat-nate-diaz-celebrates-with-the-rock-2019-11","urlToImage":"https://image.businessinsider.com/5dbea3822f364a4e772dc4a2?width=1200&format=jpeg","publishedAt":"2019-11-03T10:59:00Z","content":"Jorge Masvidal opened Nate Diaz up with bloody cuts, forcing a bloody stoppage in the UFC 244 main event at Madison Square Garden in New York City on Saturday.\r\nThe cuts were so bad it forced a referee's stoppage, anointing Masvidal as the \"baddest mother f--… [+3199 chars]"},{"source":{"id":"the-new-york-times","name":"The New York Times"},"author":"Catie Edmondson","title":"In Another Bipartisan Rebuke of Trump, House Votes for Sanctions Against Turkey","description":"House Republicans broke from President Trump en masse for a second time this month to condemn his foreign policy in Syria.","url":"https://www.nytimes.com/2019/10/29/us/politics/house-turkey-sanctions.html","urlToImage":"https://static01.nyt.com/images/2019/10/29/us/politics/29dc-sanctions/29dc-sanctions-facebookJumbo.jpg","publishedAt":"2019-10-29T21:55:28Z","content":"We let Turkey into NATO to protect them from the Soviet Union, Mr. McCaul said. And now our NATO ally is buying Russian equipment, Russian military equipment and, through its invasion into Syria, threatening our allies.\r\nOnly a handful of libertarian-minded T… [+2810 chars]"}]}